{
  "title": "Artificial Intelligence, Machine Learning, and Psychology",
  "authors": "Chong Ho Yu",
  "abstract": "<p>In 2019, the United States established a national task force for coordinating AI strategies across the federal government, industry, and academia in order to promote scientific discovery, economic competitiveness, and national security. In addition, the 2023 Organisation for Economic Co-operation and Development’s report indicates that AI has become a global competition. Hence, AI is here to stay and this trend is too important to ignore or downplay. From the incubation and development of AI, the relationship between AI and psychology is symbiotic. As cognitive psychologists and neuroscientists gain more insight into how the brain works, AI has been developed by mimicking human neural pathways. On the other hand, insights derived from AI research can be applied to a variety of subfields in psychology, whereas new social issues emerged from AI applications, such as AI bias, echo chambers, and misuse of AI tools (e.g., ChatGPT and Midjourney), led to new research topics in psychology. Further, several schools of thought of AI, such as the connectionist, symbolic, and analogist approaches, heavily borrowed ideas from psychological research. For example, in an attempt to build structural intelligence, connectionists draw an analogy between human neural networks and artificial neural networks. Moreover, AI symbolists subscribe to the notion that the human mental process is a logical production system. Furthermore, prior psychological research indicates that analogical thinking is commonly employed for problem-solving, and this notion became the foundation of example-based machine learning. Similarly, reinforcement learning in AI was inspired by behavioral psychology. Additionally, in line with the findings of developmental psychology that a child learns best through spontaneous discovery, AI researchers believe that setting the deep learning system free will be the most promising research direction. A vast number of pioneers of AI research who devoted efforts to the preceding research agendas are psychologists or received training in psychology, such as Frank Rosenblatt, Allen Newell, John Anderson, David Rumelhart, and Geoffrey Hinton, whereas some were inspired by cognitive science or neuroscience, such as Fei-Fei Li, Demis Hassabis, and Yann LeCun. In addition, in their work Artificial Psychology: Psychological Modeling and Testing of AI Systems (cited under Artificial Psychology) Crowder and his colleagues examined the bidirectional relationship between artificial intelligence and psychology, focusing on cognitive architectures and artificial emotions. The authors proposed comprehensive mathematical models for cognitive architectures, envisioning an AI system capable of reasoning about emotions, adapting to humans, and constructing knowledge representations based on experiences.</p>",
  "doi": "10.1093/obo/9780199828340-0323",
  "publisher": "Oxford University Press",
  "year": null,
  "url": "https://doi.org/10.1093/obo/9780199828340-0323",
  "source": "CrossRef",
  "query": "artificial intelligence machine learning"
}